app/controllers/schoolclasses_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @schoolclasses = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-09-19 12:05:37.797296"], ["updated_at", "2019-09-19 12:05:37.797296"]]
---
  def create
    @schoolclass = SchoolClass.new
    @schoolclass.title = params[:school_class][:title]
    @schoolclass.room_number = params[:school_class][:room_number]
    @schoolclass.save